# Pandas

In [3]:
# Importar bibliotecas
import pandas as pd
import numpy as np

# Criar vetor
vet = np.random.randint(low = 1, high = 20, size = 26) # vetor de uma dimensão com 26 
vet

array([ 2, 18,  9,  3,  7, 13,  4,  7,  6,  3,  4, 11, 19,  5, 12, 16,  8,
        7,  7,  9, 11,  5,  8, 13,  6, 13])

In [ ]:
# Criar uma série a partir de vetor
df = pd.Series(vet)
df.head()
df.tail(n = 6)

20    12
21     2
22    10
23     2
24     8
25     7
dtype: int64

In [ ]:
# Fazer reshape: transforma em array de 2 dimensões
vet2 = vet.reshape(2, 13) # transformar em 3 linhas e 12 colunas
vet2

array([[ 7,  8, 15, 12,  1, 11, 10,  5,  3,  1,  3, 17, 11],
       [14,  6,  2, 14, 17,  5, 18, 12,  2, 10,  2,  8,  7]])

In [ ]:
# Criar data frame com duas colunas
df2 = pd.DataFrame(vet2)
df2

   0   1   2   3   4   5   6   7   8   9   10  11  12
0   7   8  15  12   1  11  10   5   3   1   3  17  11
1  14   6   2  14  17   5  18  12   2  10   2   8   7

In [ ]:
# Nomear colunas
df2.columns = list(["jan/01", "fev/01", "mar/01", "abr/01", "mai/01", "jun/01", "jul/01", "ago/01", "set/01", "out/01", "nov/01", "dez/01", "jan/02"])
df2

   jan/01  fev/01  mar/01  abr/01  ...  out/01  nov/01  dez/01  jan/02
0       7       8      15      12  ...       1       3      17      11
1      14       6       2      14  ...      10       2       8       7

[2 rows x 13 columns]

In [ ]:
# Nomear linhas
df2.index = list(["Fernando", "Manoela"])
df2

          jan/01  fev/01  mar/01  abr/01  ...  out/01  nov/01  dez/01  jan/02
Fernando       7       8      15      12  ...       1       3      17      11
Manoela       14       6       2      14  ...      10       2       8       7

[2 rows x 13 columns]

In [ ]:
# Acessar elementos
df2.iloc[0,0]

7

In [ ]:
df2.loc["Fernando", "ago/01"]

5

In [ ]:
# Acessar múltiplos valores
df2.loc[["Fernando", "Manoela"], "ago/01"]

Fernando     5
Manoela     12
Name: ago/01, dtype: int64

In [ ]:
# Ou:
df2.loc[:, "ago/01"] # o dois pontos significa todas as linhas

Fernando     5
Manoela     12
Name: ago/01, dtype: int64

In [ ]:
# Estatísticas descritivas
df2.describe()

          jan/01    fev/01     mar/01  ...    nov/01     dez/01     jan/02
count   2.000000  2.000000   2.000000  ...  2.000000   2.000000   2.000000
mean   10.500000  7.000000   8.500000  ...  2.500000  12.500000   9.000000
std     4.949747  1.414214   9.192388  ...  0.707107   6.363961   2.828427
min     7.000000  6.000000   2.000000  ...  2.000000   8.000000   7.000000
25%     8.750000  6.500000   5.250000  ...  2.250000  10.250000   8.000000
50%    10.500000  7.000000   8.500000  ...  2.500000  12.500000   9.000000
75%    12.250000  7.500000  11.750000  ...  2.750000  14.750000  10.000000
max    14.000000  8.000000  15.000000  ...  3.000000  17.000000  11.000000

[8 rows x 13 columns]

# Importar arquivo CSV

In [ ]:
# Salvar objeto como arquivo CSV
df2.to_csv("arquivo.csv")

# Importar
df3 = pd.read_csv("arquivo.csv")

df3

  Unnamed: 0  jan/01  fev/01  mar/01  ...  out/01  nov/01  dez/01  jan/02
0   Fernando       7       8      15  ...       1       3      17      11
1    Manoela      14       6       2  ...      10       2       8       7

[2 rows x 14 columns]

# Importar arquivo Excel

In [ ]:
# Salvar objeto como arquivo XLSX
df2.to_excel("arquivo.xlsx")

# Importar
df4 = pd.read_excel("arquivo.xlsx")

df4

  Unnamed: 0  jan/01  fev/01  mar/01  ...  out/01  nov/01  dez/01  jan/02
0   Fernando       7       8      15  ...       1       3      17      11
1    Manoela      14       6       2  ...      10       2       8       7

[2 rows x 14 columns]

In [1]:
# Exercício

In [14]:
# 1. Importe a base de dados DadosDemograficos.csv
dados = pd.read_csv("https://drive.google.com/uc?id=1cFWkYTwxNl-C-Yrdvy3U3WuRXH0WYVJW&export=download")

# 2. Visualize as 6 primeiras linhas. (dica: função head
dados.head(6)

           Country Name Country Code  ...  Internet users         Income Group
0                 Aruba          ABW  ...            78.9          High income
1           Afghanistan          AFG  ...             5.9           Low income
2                Angola          AGO  ...            19.1  Upper middle income
3               Albania          ALB  ...            57.2  Upper middle income
4  United Arab Emirates          ARE  ...            88.0          High income
5             Argentina          ARG  ...            59.9          High income

[6 rows x 5 columns]

In [16]:
# 3. Que país tem alta taxa de nascimento (>35), poucas pessoas com acesso à internet (<25) e alta renda ? (dica: operador e: &)
filtro = (dados["Birth rate"] > 35) & (dados["Internet users"] < 25) & (dados["Income Group"] == "High income")
filtro

0      False
1      False
2      False
3      False
4      False
       ...
190    False
191    False
192    False
193    False
194    False
Length: 195, dtype: bool

In [17]:
dados[filtro] # país com verdadeiro

         Country Name Country Code  Birth rate  Internet users Income Group
67  Equatorial Guinea          GNQ      35.362            16.4  High income

In [24]:
# 4. Que país tem alta taxa de nascimento (>45 ), poucas pessoas com acesso à internet (<25) e renda média alta?
filtro2 = (dados["Birth rate"] > 45) & (dados["Internet users"] < 25) & (dados["Income Group"] == "Upper middle income")
filtro2

0      False
1      False
2       True
3      False
4      False
       ...
190    False
191    False
192    False
193    False
194    False
Length: 195, dtype: bool

In [25]:
dados[filtro2]

  Country Name Country Code  Birth rate  Internet users         Income Group
2       Angola          AGO      45.985            19.1  Upper middle income

In [26]:
# 5.Imprima todas as informações de Malta.
filtro3 = dados["Country Name"] == "Malta"
filtro3

0      False
1      False
2      False
3      False
4      False
       ...
190    False
191    False
192    False
193    False
194    False
Name: Country Name, Length: 195, dtype: bool

In [27]:
dados[filtro3]

    Country Name Country Code  Birth rate  Internet users Income Group
116        Malta          MLT         9.5         68.9138  High income